.config/doom/config.org
* Doom Emacs Config

I might forget that this file is autogenerated... so let's set a reminder!

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; ! THIS FILES IS AUTOGENERATED FROM config.org
;; ! DO NOT EDIT MANUALLY
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

#+end_src

** Identity

Our identity is required for some stuff (gpg, email, templates. snippets...)

#+begin_src emacs-lisp

(setq user-full-name       "Julien Tant"
      user-mail-address    "julien@craftyx.fr")

#+end_src

** Font and Theme

#+begin_src emacs-lisp

(setq doom-font                (font-spec :family "JetBrainsMono Nerd Font" :size 15)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 15)
      doom-big-font            (font-spec :family "JetBrainsMono Nerd Font" :size 24))

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))


(setq doom-theme 'doom-gruvbox)

;; display the absolute line numbers (with t). other options are nil (no line numbers) or relative (line numbers relative to the cursor position)
(setq display-line-numbers-type t)

#+end_src

#+RESULTS:
: t


** Org & Roam2 Directory

Both Org and Roam need to have a directory set. We use ~file-truename~ to resolve symlink if necessary.

#+begin_src emacs-lisp

(make-directory "~/org" 'parents)
(make-directory "~/org-roam" 'parents)

(setq org-directory (file-truename "~/org/"))
(setq org-roam-directory (file-truename "~/org-roam"))


#+end_src


** Auto Tangle org files

Using the [[https://github.com/yilkalargaw/org-auto-tangle][auto-tangle-org]] package, any org files containing a non nil ~#+auto_tangle:~ option will be tangled

#+begin_src emacs-lisp

 (use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  )

#+end_src

this file is NOT auto tangled. It's tangled automatically by doom when running ~doom sync~


** IRC

#+begin_src emacs-lisp
(after! circe
  (set-irc-server! "irc.libera.chat"
    `(:tls t
      :port 6697
      :nick "JulienTant"
      :sasl-username "JulienTant"
      :sasl-password (lambda (&rest _) (+pass-get-secret "irc/libera.chat"))
      :channels ("#emacs", "#neomutt"))))
#+end_src
